БухЭксп/Catalogs/CW_ЭлектронныеПисьмаДляОтправки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ЭлектронныеПисьмаДляОтправки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучателиСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправитьДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправитьПосле</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ВидыПолучателейЭлектронныхПисем</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтображаемоеИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Тексты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипТекста</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кодировка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Вложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вложение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расширение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>MIME</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьИдентификатор</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СтатусОбработкиЭлектронныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СтатусОбработкиЭлектронныхПисем</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_СтатусыОбработкиПочтовыхСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЭлектронноеПисьмо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ЭлектронныеПисьмаДляОтправки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ПризнакОтправкиПоЭлектроннойПочте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПризнакОтправкиПоЭлектроннойПочте</Name>
			<Comment>была ли успешная отправка</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОтправки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_СтатусыОтправкиПоЭлектроннойПочте</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Catalogs/CW_ЭлектронныеПисьмаДляОтправки/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СохранитьВложение(Команда)
	
	СтрокаТЧ = Объект.Вложения.НайтиПоИдентификатору(Элементы.Вложения.ТекущаяСтрока);
	
	СтруктураОтвета = _ПолучитьВложениеПисьма(СтрокаТЧ.НомерСтроки);
	
	Если СтруктураОтвета.Код = 0 Тогда
		
		// --- получаем файл
		ПараметрыДиалогаПолученияФайлов = Новый ПараметрыДиалогаПолученияФайлов;
		ПараметрыДиалогаПолученияФайлов.ВыборКаталога = Истина;
		
		НачатьПолучениеФайлаССервера(СтруктураОтвета.АдресФайла,СтрокаТЧ.ИмяФайла,ПараметрыДиалогаПолученияФайлов);
		
		
	Иначе
		
		Сообщить(СтруктураОтвета.ОписаниеОшибки);
		
	КонецЕсли; 

	
КонецПроцедуры

&НаСервере
Функция _ПолучитьВложениеПисьма(Знач СтрокаТЧ)
	// --- 
	
	Ответ = _УФКС.Ответ(0);
	
	Попытка
		
		Справочник = РеквизитФормыВЗначение("Объект");
		
		СтрокаТЧ = Справочник.Вложения[СтрокаТЧ-1];
		Ответ.Вставить("АдресФайла",ПоместитьВоВременноеХранилище(СтрокаТЧ.Вложение.Получить(),УникальныйИдентификатор));

		ЗначениеВРеквизитФормы(Справочник,"Объект");
		
		Возврат(Ответ);
		
	Исключение
		
		Ответ.Код = 1;
		Ответ.ОписаниеОшибки = ОписаниеОшибки();
		
		Возврат(Ответ);
		
	КонецПопытки; 
	
	// --- 
КонецФункции
 

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура СохранитьТекст(Команда)
	
	СтрокаТЧ = Объект.Тексты.НайтиПоИдентификатору(Элементы.Тексты.ТекущаяСтрока);
	
	СтруктураОтвета = _ПолучитьТекстПисьма(СтрокаТЧ.НомерСтроки);
	
	Если СтруктураОтвета.Код = 0 Тогда
		
		// --- получаем файл
		ПараметрыДиалогаПолученияФайлов = Новый ПараметрыДиалогаПолученияФайлов;
		ПараметрыДиалогаПолученияФайлов.ВыборКаталога = Истина;
		
		НачатьПолучениеФайлаССервера(СтруктураОтвета.АдресФайла,"Текст"+СтрокаТЧ.НомерСтроки+".txt",ПараметрыДиалогаПолученияФайлов);
		
	Иначе
		
		Сообщить(СтруктураОтвета.ОписаниеОшибки);
		
	КонецЕсли; 

	
КонецПроцедуры

&НаСервере
Функция _ПолучитьТекстПисьма(Знач СтрокаТЧ)
	// --- 
	
	Ответ = _УФКС.Ответ(0);
	
	Попытка
		
		Справочник = РеквизитФормыВЗначение("Объект");
		
		СтрокаТЧ = Справочник.Тексты[СтрокаТЧ-1];
		Ответ.Вставить("АдресФайла",ПоместитьВоВременноеХранилище(СтрокаТЧ.ДД.Получить(),УникальныйИдентификатор));

		ЗначениеВРеквизитФормы(Справочник,"Объект");
		
		Возврат(Ответ);
		
	Исключение
		
		Ответ.Код = 1;
		Ответ.ОписаниеОшибки = ОписаниеОшибки();
		
		Возврат(Ответ);
		
	КонецПопытки; 
		
	// --- 
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьДанныеОтправки();
	
	СтатусОбработки = РегистрыСведений.CW_СтатусОбработкиЭлектронныхПисем.ПолучитьСтатусОбработки(Объект.Ссылка);
	
	Элементы.ГруппаСостояние.Видимость = ЗначениеЗаполнено(Объект.СсылкаНаОбъект);
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДанныеОтправки()
	
	Если Объект.СсылкаНаОбъект.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПризнакОтправкиПоЭлектроннойПочте.Документ КАК Документ,
	               |	CW_ПризнакОтправкиПоЭлектроннойПочте.ДатаОтправки КАК ДатаОтправки,
	               |	CW_ПризнакОтправкиПоЭлектроннойПочте.СтатусОтправки КАК СтатусОтправки
	               |ИЗ
	               |	РегистрСведений.CW_ПризнакОтправкиПоЭлектроннойПочте КАК CW_ПризнакОтправкиПоЭлектроннойПочте
	               |ГДЕ
	               |	CW_ПризнакОтправкиПоЭлектроннойПочте.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Объект.СсылкаНаОбъект);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДатаОтправки 	= Выборка.ДатаОтправки;
		СтатусОтправки 	= Выборка.СтатусОтправки;
	Конецесли;
	
КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя, Элементы.Список.ВыделенныеСтроки);
	
КонецПроцедуры

#КонецОбласти
